src/cf/Catalogs/ШаблоныНаименований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныНаименований</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНаименования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаименованийОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекурсивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляПредставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляФормирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ТоварВнеБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ор_ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ор_РеквизитыДляЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ШаблоныНаименований/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьНастройкиФормированияНаименований(Форма, Настройки) Экспорт
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("ТребуетсяОбновитьНаименования", Истина);
	Настройки.Вставить("СформированныеНаименования", Новый СписокЗначений);
	Настройки.Вставить("СписокСвойств", Новый СписокЗначений);
	Настройки.Вставить("НаименованиеПолучено", Ложь);
	
	Форма.ШаблоныНаименованийКэш.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		
		ФормироватьНаименованиеАвтоматически = НЕ ЗначениеЗаполнено(Форма.Объект.Наименование);
		
		Если ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			Категория = Форма.Объект.КатегорияНоменклатуры;
			Шаблоны = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийКатегории(Категория, Ложь);
			
			Если Шаблоны.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			Если ФормироватьНаименованиеАвтоматически Тогда
				ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее;
				Шаблон = ВыбратьШаблонНаименования(
					Шаблоны,
					Категория,
					ВидНаименования);
				ДобавитьИнформациюОШаблонеВНастройкиФормы(Форма, Шаблон, ВидНаименования);
			КонецЕсли;
			
			Если ФормироватьНаименованиеАвтоматически Тогда
				ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураДляПечати;
				Шаблон = ВыбратьШаблонНаименования(
					Шаблоны,
					Категория,
					ВидНаименования);
				ДобавитьИнформациюОШаблонеВНастройкиФормы(Форма, Шаблон, ВидНаименования);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
			
			Категория = Форма.КатегорияНоменклатуры;
			Шаблоны = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийКатегории(Категория, Истина);
			
			Если Шаблоны.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			Если ФормироватьНаименованиеАвтоматически Тогда
				ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее;
				Шаблон = ВыбратьШаблонНаименования(
					Шаблоны,
					Категория,
					ВидНаименования);
				ДобавитьИнформациюОШаблонеВНастройкиФормы(Форма, Шаблон, ВидНаименования);
			КонецЕсли;
			
			Если ФормироватьНаименованиеАвтоматически Тогда
				ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаДляПечати;
				Шаблон = ВыбратьШаблонНаименования(
					Шаблоны,
					Категория,
					ВидНаименования);
				ДобавитьИнформациюОШаблонеВНастройкиФормы(Форма, Шаблон, ВидНаименования);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			Шаблоны = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийДоговоровКонтрагентов();
			
			Если Шаблоны.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			Если ФормироватьНаименованиеАвтоматически Тогда
				Шаблон = Шаблоны[0].Ссылка;
				ДобавитьИнформациюОШаблонеВНастройкиФормы(Форма, Шаблон, ВидНаименования);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСписокСвойствОбъекта(Форма, Истина);
	
КонецПроцедуры

Процедура СоздатьШаблоныПоУмолчанию(Категория) Экспорт
	
	Шаблон = "{[Наименование]}{ [Артикул]}";
	
	ШаблонОбъект = Справочники.ШаблоныНаименований.СоздатьЭлемент();
	ШаблонОбъект.Владелец = Категория.Ссылка;
	ШаблонОбъект.КатегорияНоменклатуры = Категория.Ссылка;
	ШаблонОбъект.ДляХарактеристики = Ложь;
	ШаблонОбъект.ШаблонДляПредставления = Шаблон;
	ШаблонОбъект.ШаблонДляФормирования = Шаблон;
	СформироватьНаименованиеШаблона(ШаблонОбъект);
	ШаблонОбъект.Записать();
	
	Шаблон = "{[Наименование]}{ [Код]}";
	
	ШаблонОбъект = Справочники.ШаблоныНаименований.СоздатьЭлемент();
	ШаблонОбъект.Владелец = Категория.Ссылка;
	ШаблонОбъект.КатегорияНоменклатуры = Категория.Ссылка;
	ШаблонОбъект.ДляХарактеристики = Ложь;
	ШаблонОбъект.ШаблонДляПредставления = Шаблон;
	ШаблонОбъект.ШаблонДляФормирования = Шаблон;
	СформироватьНаименованиеШаблона(ШаблонОбъект);
	ШаблонОбъект.Записать();
	
	Шаблон = НСтр("ru = 'Основной договор'");
	
	ШаблонОбъект = Справочники.ШаблоныНаименований.СоздатьЭлемент();
	ШаблонОбъект.Владелец = Категория.Ссылка;
	ШаблонОбъект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента;
	ШаблонОбъект.ДляХарактеристики = Ложь;
	ШаблонОбъект.ШаблонДляПредставления = Шаблон;
	ШаблонОбъект.ШаблонДляФормирования = Шаблон;
	СформироватьНаименованиеШаблона(ШаблонОбъект);
	ШаблонОбъект.Записать();
	
	Константы.ШаблонНаименованияДоговоров.Установить(ШаблонОбъект.Ссылка);
	
	Шаблон = НСтр("ru = '{№ [НомерДоговора]}{ от [ДатаНачала]}{ ([Валюта])}'");
	
	ШаблонОбъект = Справочники.ШаблоныНаименований.СоздатьЭлемент();
	ШаблонОбъект.Владелец = Справочники.КатегорииНоменклатуры.БезКатегории;
	ШаблонОбъект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента;
	ШаблонОбъект.ДляХарактеристики = Ложь;
	ШаблонОбъект.ШаблонДляПредставления = Шаблон;
	ШаблонОбъект.ШаблонДляФормирования = Шаблон;
	СформироватьНаименованиеШаблона(ШаблонОбъект);
	ШаблонОбъект.Записать();
	
КонецПроцедуры

Процедура СоздатьШаблоныПоУмолчаниюДляНабораСвойств(Категория, НаборСвойств, ДляХарактеристики) Экспорт
	
	Если ДляХарактеристики Тогда
		Если НаборСвойств.ДополнительныеРеквизиты.Количество() <> 0 Тогда
			
			ШаблонОбъект = Справочники.ШаблоныНаименований.СоздатьЭлемент();
			ШаблонОбъект.Владелец = Категория.Ссылка;
			ШаблонОбъект.КатегорияНоменклатуры = Категория.Ссылка;
			ШаблонОбъект.ДляХарактеристики = ДляХарактеристики;
			ШаблонОбъект.НаборСвойств = НаборСвойств;
			ШаблонОбъект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее;
			ШаблонОбъект.ЭтоПредопределенный = Истина;
			СФормироватьШаблон(ШаблонОбъект, НаборСвойств);
			СформироватьНаименованиеШаблона(ШаблонОбъект);
			ШаблонОбъект.Записать();
			
			ШаблонОбъект = Справочники.ШаблоныНаименований.СоздатьЭлемент();
			ШаблонОбъект.Владелец = Категория.Ссылка;
			ШаблонОбъект.КатегорияНоменклатуры = Категория.Ссылка;
			ШаблонОбъект.ДляХарактеристики = ДляХарактеристики;
			ШаблонОбъект.НаборСвойств = НаборСвойств;
			ШаблонОбъект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаДляПечати;
			ШаблонОбъект.ЭтоПредопределенный = Истина;
			СФормироватьШаблон(ШаблонОбъект, НаборСвойств);
			СформироватьНаименованиеШаблона(ШаблонОбъект);
			ШаблонОбъект.Записать();
			
		КонецЕсли;
	Иначе
		Если НаборСвойств.ДополнительныеРеквизиты.Количество() <> 0 Тогда
			
			ШаблонОбъект = Справочники.ШаблоныНаименований.СоздатьЭлемент();
			ШаблонОбъект.Владелец = Категория.Ссылка;
			ШаблонОбъект.КатегорияНоменклатуры = Категория.Ссылка;
			ШаблонОбъект.ДляХарактеристики = ДляХарактеристики;
			ШаблонОбъект.НаборСвойств = НаборСвойств;
			ШаблонОбъект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее;
			ШаблонОбъект.ЭтоПредопределенный = Истина;
			СФормироватьШаблон(ШаблонОбъект, НаборСвойств);
			СформироватьНаименованиеШаблона(ШаблонОбъект);
			ШаблонОбъект.Записать();
			
			ШаблонОбъект = Справочники.ШаблоныНаименований.СоздатьЭлемент();
			ШаблонОбъект.Владелец = Категория.Ссылка;
			ШаблонОбъект.КатегорияНоменклатуры = Категория.Ссылка;
			ШаблонОбъект.ДляХарактеристики = ДляХарактеристики;
			ШаблонОбъект.НаборСвойств = НаборСвойств;
			ШаблонОбъект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураДляПечати;
			ШаблонОбъект.ЭтоПредопределенный = Истина;
			СФормироватьШаблон(ШаблонОбъект, НаборСвойств);
			СформироватьНаименованиеШаблона(ШаблонОбъект);
			ШаблонОбъект.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНаименованиеШаблона(ШаблонОбъект) Экспорт
	
	Наименование = "";
	ТекстовыеБлоки = Новый Массив;
	Блоки = ШаблоныНаименованийКлиентСервер.РазделитьШаблонНаБлоки(ШаблонОбъект.ШаблонДляПредставления);
	
	Для каждого Блок Из Блоки Цикл
		
		НовыйБлок = "%1%2%3";
		Если ЗначениеЗаполнено(Блок.Параметр) Тогда
			ПредставлениеПараметра = "[" + Блок.Параметр + "]";
		Иначе
			ПредставлениеПараметра = "";
		КонецЕсли;
		НовыйБлок = СтрШаблон(НовыйБлок, Блок.ТекстСлева, ПредставлениеПараметра, Блок.ТекстСправа);
		
		Наименование = Наименование + НовыйБлок;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		Наименование = СокрЛП(Наименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		ШаблонОбъект.Наименование = Наименование;
	Иначе
		ШаблонОбъект.Наименование = НаименованиеНезаполненногоШаблона();
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНаименования(Форма, Категория = Неопределено) Экспорт
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		ДляХарактеристики = Ложь;
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		ДляХарактеристики = Истина;
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) <> Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Возврат;
	КонецЕсли;
	
	СписокСвойств = Форма.ШаблоныНаименованийНастройки.СписокСвойств;
	
	СформированныеНаименования = Новый СписокЗначений;
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Шаблоны = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийДоговоровКонтрагентов();
	Иначе
		Шаблоны = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийКатегории(Категория, ДляХарактеристики);
	КонецЕсли;
	
	Для каждого Шаблон Из Шаблоны Цикл
		
		Если Шаблон.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаДляПечати Тогда
			ДобавитьШаблонПолногоНаименования(Форма, СписокСвойств, Шаблон, СформированныеНаименования);		
		КонецЕсли;
		
		СФормированноеНаименование = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(СписокСвойств, Шаблон.ШаблонДляФормирования);
		Если ЗначениеЗаполнено(СФормированноеНаименование) И НЕ УжеЕстьТакоеНаименование(СформированныеНаименования, СФормированноеНаименование) Тогда
			СформированныеНаименования.Добавить(Шаблон.Ссылка, СФормированноеНаименование);
		КонецЕсли;
		
	КонецЦикла;
	
	СформированныеНаименования.Добавить(Справочники.ШаблоныНаименований.ПустаяСсылка(),
		НСтр("ru='<показать все шаблоны>'"),,БиблиотекаКартинок.Выбрать);
	
	Форма.ШаблоныНаименованийНастройки.ТребуетсяОбновитьНаименования = Ложь;
	Форма.ШаблоныНаименованийНастройки.СФормированныеНаименования = СформированныеНаименования;
	
КонецПроцедуры

Процедура ЗапомнитьШаблоныДляВидовНаименований(Форма, КатегорияНоменклатуры) Экспорт
	
	Для каждого ШаблонКэш Из Форма.ШаблоныНаименованийКэш Цикл
		
		ВидНаименования = ШаблонКэш.ВидНаименования;
		Шаблон          = ШаблонКэш.ШаблонСсылка;
		
		ТекущийШаблон = ШаблоныНаименованийПовтИсп.ПолучитьШаблонДляВидаНаименования(КатегорияНоменклатуры, ВидНаименования);
		Если Шаблон = ТекущийШаблон Тогда
			Возврат;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ШаблоныНаименований.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.КатегорияНоменклатуры.Установить(КатегорияНоменклатуры);
		НаборЗаписей.Отбор.ВидНаименования.Установить(ВидНаименования);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.КатегорияНоменклатуры = КатегорияНоменклатуры;
			НоваяЗапись.ВидНаименования       = ВидНаименования;
			НоваяЗапись.Шаблон                = Шаблон;
			
		Иначе
			
			Запись = НаборЗаписей.Получить(0);
			Запись.Шаблон = Шаблон;
			
		КонецЕсли;
		
		НаборЗаписей.Записать();
		ОбновитьПовторноИспользуемыеЗначения();
		
	КонецЦикла;
	
КонецПроцедуры

Функция НаименованиеНезаполненногоШаблона() Экспорт
	
	Возврат НСтр("ru='<пустой>'");
	
КонецФункции

Процедура НаборыДополнительныхРеквизитовИСведенийПриЗаписи(Объект, Отказ) Экспорт
	
	Если Объект.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
		
	Если Объект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Предопределенный Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныНаименований.Ссылка
	|ИЗ
	|	Справочник.ШаблоныНаименований КАК ШаблоныНаименований
	|ГДЕ
	|	ШаблоныНаименований.ЭтоПредопределенный
	|	И ШаблоныНаименований.НаборСвойств = &НаборСвойств";
	
	Запрос.УстановитьПараметр("НаборСвойств", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		
		// Редактируем имеющиеся предопределенные шаблоны.
		
		Пока Выборка.Следующий() Цикл
			
			Шаблон = Выборка.Ссылка.ПолучитьОбъект();
			
			СФормироватьШаблон(Шаблон, Объект);
			СформироватьНаименованиеШаблона(Шаблон);
			Шаблон.Записать();
			
		КонецЦикла;
		
	Иначе
		
		// Создаем новые предопределенные шаблоны.
		ЗапросКатегории = Новый Запрос;
		ЗапросКатегории.Текст = 
		"ВЫБРАТЬ
		|	КатегорииНоменклатуры.Ссылка,
		|	КатегорииНоменклатуры.НаборСвойств,
		|	КатегорииНоменклатуры.НаборСвойствХарактеристики
		|ИЗ
		|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
		|ГДЕ
		|	КатегорииНоменклатуры.НаборСвойств = &НаборСвойств
		|	ИЛИ КатегорииНоменклатуры.НаборСвойствХарактеристики = &НаборСвойств";
		
		ЗапросКатегории.УстановитьПараметр("НаборСвойств", Объект.Ссылка);
		
		ВыборкаКатегории = ЗапросКатегории.Выполнить().Выбрать();
		Пока ВыборкаКатегории.Следующий() Цикл
			
			ДляХарактеристики = ВыборкаКатегории.НаборСвойств <> Объект.Ссылка 
								И ВыборкаКатегории.НаборСвойствХарактеристики = Объект.Ссылка;
			СоздатьШаблоныПоУмолчаниюДляНабораСвойств(ВыборкаКатегории.Ссылка, Объект.Ссылка, ДляХарактеристики);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Функция ЗаполнитьСписокСвойствОбъекта(Форма, ПриСозданииНаСервере = Ложь) Экспорт
	
	Форма.ШаблоныНаименованийНастройки.СписокСвойств.Очистить();
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		ЗаполнитьСписокСвойствОбъектаНоменклатура(Форма, Форма.ШаблоныНаименованийНастройки.СписокСвойств, ПриСозданииНаСервере);
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		ЗаполнитьСписокСвойствОбъектаХарактеристика(Форма, Форма.ШаблоныНаименованийНастройки.СписокСвойств);
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ЗаполнитьСписокСвойствОбъектаДоговор(Форма, Форма.ШаблоныНаименованийНастройки.СписокСвойств, ПриСозданииНаСервере);
	КонецЕсли;
	
КонецФункции

Функция ОбработатьРезультатВыбора(РезультатЗначение, РезультатПредставление) Экспорт
	
	ВыбранноеЗначение = Новый Структура;
	ВыбранноеЗначение.Вставить("ШаблонСсылка", РезультатЗначение);
	ВыбранноеЗначение.Вставить("Наименование", РезультатПредставление);
	ВыбранноеЗначение.Вставить("ШаблонДляФормирования", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РезультатЗначение, "ШаблонДляФормирования"));
	
	Возврат ВыбранноеЗначение;
	
КонецФункции

Функция НаименованиеДоговораПоУмолчанию(Договор) Экспорт
	
	СписокСвойств = Новый СписокЗначений;
	ПолучитьСписокСвойствДоговора(Договор, СписокСвойств);
	ШаблонДляФормирования = ШаблонНаименованияДоговораПоУмолчанию();
	
	Возврат ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(СписокСвойств, ШаблонДляФормирования);
	
КонецФункции

#Область ОтраслевыеПроцедурыИФункции

// Сформировать начальные параметры по правилу.
//
// Параметры:
//  ВидНаименования	 - ПеречислениеСсылка.ВидыНаименованийОбъектов - вид шаблона наименований.
// 
// Возвращаемое значение:
//   - Структура.
//
Функция СформироватьНачальныеПараметрыПоПравилу(ВидНаименования) Экспорт
	
	НачальныеПараметры = Новый Структура();
	
	УказаныйВид = ?(ЗначениеЗаполнено(ВидНаименования), ВидНаименования, Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее);
	
	Если УказаныйВид = Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее
		Или УказаныйВид = Перечисления.ВидыНаименованийОбъектов.НоменклатураДляПечати Тогда
		НачальныеПараметры.Вставить("НаборРеквизитов" , Метаданные.Справочники.Номенклатура.Реквизиты);
		НачальныеПараметры.Вставить("ПутьКСправочнику", "Номенклатура.");
	ИначеЕсли УказаныйВид = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее
		Или УказаныйВид = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаДляПечати Тогда
		НачальныеПараметры.Вставить("НаборРеквизитов" , Метаданные.Справочники.ХарактеристикиНоменклатуры.Реквизиты);
		НачальныеПараметры.Вставить("ПутьКСправочнику", "ХарактеристикиНоменклатуры.");
	КонецЕсли;
	
	Возврат НачальныеПараметры;
	
КонецФункции

// Проверяет использование реквизита номенклатуры в информационной базе.
//
// Параметры:
//  ИмяРеквизита - Строка	 - имя реквизита справочника "Номенклатура".
//  ТоварВнеБазы - Булево	 - признак товара отстутсвуюещ
// 
// Возвращаемое значение:
//   - Булево.
//
Функция РеквизитИспользуется(ИмяРеквизита, ТоварВнеБазы = Ложь) Экспорт
	
	Если ИмяРеквизита = "НаименованиеПолное"
		Или ИмяРеквизита = "ТипНоменклатуры"
		Или ИмяРеквизита = "ФайлКартинки"
		Или ИмяРеквизита = "КодМедицинскогоИзделия" Тогда
		Возврат Ложь;
	ИначеЕсли Лев(ИмяРеквизита,7) = "Удалить" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ИмяРеквизита = "Договор"
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКонтрагентов") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрНайти(ИмяРеквизита,"ГИСМ") <> 0
		И Не ПолучитьФункциональнуюОпцию("ВестиУчетМаркировкиПродукцииВГИСМ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ВестиСведенияДляДекларацийПоАлкогольнойПродукции") Тогда
		Если ИмяРеквизита = "ВидАлкогольнойПродукции"
			Или ИмяРеквизита = "ОбъемДАЛ"
			Или ИмяРеквизита = "Крепость"
			Или ИмяРеквизита = "ПроизводительИмпортерАлкогольнойПродукции" 
			Или ИмяРеквизита = "ИмпортнаяАлкогольнаяПродукция" Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяРеквизита = "ор_НаименованиеПоставщика" И НЕ ТоварВнеБазы Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// + ор
	// Добавляем в исключение типовой реквизит.
	Если ИмяРеквизита = "Производитель" Тогда
		Возврат Ложь;
	КонецЕсли;
	// - ор
	
	Возврат Истина;
	
КонецФункции

// Проверяет использование отраслевого реквизита номенклатуры в информационной базе.
//
// Параметры:
//  ИмяРеквизита	 - Строка	 - имя реквизита справочника "Номенклатура".
//  ВидНаименования	 - ПеречислениеСсылка.ВидыНаименованийОбъектов - вид шаблона наименований.
// 
// Возвращаемое значение:
//   - Булево.
//
функция ОтраслевойРеквизитИспользуется(ИмяРеквизита, ВидНаименования) Экспорт
	
	//Пример
	
	//Если ИмяРеквизита = "Производитель" Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	Если СтрНайти(ИмяРеквизита, "Шаблон") <> 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
Конецфункции

// Процедура заполняет список параметров правила.
//
// Параметры:
//  МассивПараметров				 - Массив	 - список параметров шаблона наименования.
//  КатегорияНоменклатуры			 - СправочникСсылка.КатегорииНоменклатуры	 - категория для которой используется шаблон.
//  Шаблон							 - СправочникСсылка.ШаблоныНаименований	 - шаблон наименования.
//  ОписаниеДополнительныхРеквизитов - ТаблицаЗначений	 - данные доп. реквизитов на форме.
//  ПодменятьРеквизиты				 - Булево	 - признак замены не стандартных реквизитов.
//
Процедура ЗаполнитьМассивПараметровШаблонаНаименования(МассивПараметров, КатегорияНоменклатуры, Шаблон, ОписаниеДополнительныхРеквизитов = Неопределено, ПодменятьРеквизиты = Ложь) Экспорт
	
	МассивПараметров = ?(ЗначениеЗаполнено(МассивПараметров), МассивПараметров, Новый Массив());
	
	ПараметрыПравила = ПолучитьСтруктуруПараметровШаблонаНаименования(
		КатегорияНоменклатуры,
		Шаблон,
		ОписаниеДополнительныхРеквизитов);
	
	ТаблицаПоиска = Новый ТаблицаЗначений();
	ТаблицаПоиска.Колонки.Добавить("ПутьКДанным");
	
	Если МассивПараметров.Количество() > 0 Тогда
		Для Н = 0 По МассивПараметров.Количество()-1 Цикл
			НоваяСтрока = ТаблицаПоиска.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивПараметров[Н]);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтрокаПараметр Из ПараметрыПравила Цикл
		Если ТаблицаПоиска.Найти(СтрокаПараметр.ПутьКДанным, "ПутьКДанным") = Неопределено Тогда
			МассивПараметров.Добавить(СтрокаПараметр);
		КонецЕсли;
	КонецЦикла;
	
	Если ПодменятьРеквизиты Тогда
		ПодменитьНестандартныеРеквизиты(МассивПараметров);
	КонецЕсли;
	
КонецПроцедуры

// Добавление реквизитов и элементов на форму.
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения	 - форма на которой добавляются элементы.
//  ГруппаЭлементов	 - ГруппаФормы	 - группа в которую добавляются элементы.
//  МассивПараметров - Массив	 - описание параметров шаблона (см. ЗаполнитьМассивПараметровШаблонаНаименования).
//
Процедура ДобавитьРеквизитыИЭлементыНаФорму(Форма, ГруппаЭлементов, МассивПараметров) Экспорт
	
	МассивРеквизитов = Новый Массив();
	Буфер            = Новый Массив();
	РеквизитыФормы   = ТекущиеРеквизитыФормы(Форма);
	
	Форма.ПараметрыПравилаИменования.Очистить();
	
	Для Каждого СтрокаПараметр Из МассивПараметров Цикл
		ИмяНаФорме = ПолучитьИмяНаФормеСозданияНоменклатуры(СтрокаПараметр.ПутьКДанным, РеквизитыФормы);
		Если РеквизитыФормы.Найти(СтрокаПараметр.ПутьКДанным) <> Неопределено
			ИЛИ ЗначениеЗаполнено(ИмяНаФорме) Тогда
			
			Буфер.Добавить(СтрокаПараметр);
		Иначе
			МассивРеквизитов.Добавить(Новый РеквизитФормы(СтрокаПараметр.ПутьКДанным, СтрокаПараметр.ТипРеквизита,, СтрокаПараметр.Заголовок));
			ЗаполнитьЗначенияСвойств(Форма.ПараметрыПравилаИменования.Добавить(),СтрокаПараметр);
		КОнецЕсли;
	КонецЦикла;
	
	ОбработатьПодмененыеРеквизиты(МассивРеквизитов);
	
	Если МассивРеквизитов.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
	КонецЕсли;
	
	ДобавитьЭлементыПравилаИменования(Форма, ГруппаЭлементов);
	
	Для каждого СтрокаПараметр Из Буфер Цикл
		ЗаполнитьЗначенияСвойств(Форма.ПараметрыПравилаИменования.Добавить(),СтрокаПараметр);
	КонецЦикла;
	
	ОбработатьПодмененыеЭлементы(Форма, МассивПараметров);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСписокСвойствОбъектаНоменклатура(Форма, СписокСвойств, ПриСозданииНаСервере)
	
	Объект = Форма.Объект;
	
	Если ПриСозданииНаСервере И Форма.Параметры.Свойство("ТекстЗаполнения")
		И ЗначениеЗаполнено(Форма.Параметры.ТекстЗаполнения) Тогда
		СписокСвойств.Добавить("Наименование", Форма.Параметры.ТекстЗаполнения);
	Иначе
		СписокСвойств.Добавить("Наименование", Объект.Наименование);
	КонецЕсли;
	СписокСвойств.Добавить("Артикул", Объект.Артикул);
	СписокСвойств.Добавить("Код", Объект.Код);
	СписокСвойств.Добавить("СтранаПроисхождения", Объект.СтранаПроисхождения);
	СписокСвойств.Добавить("Поставщик", Объект.Поставщик);
	
	СписокСвойств.Добавить("ор_НаименованиеПоставщика", Объект.ор_НаименованиеПоставщика);
	СписокСвойств.Добавить("ор_Производитель"         , Объект.ор_Производитель);
	СписокСвойств.Добавить("ор_ЕГК"                   , Объект.ор_ЕГК);
	СписокСвойств.Добавить("ор_Дозировка"             , Объект.ор_Дозировка);
	СписокСвойств.Добавить("ор_КодРосздравнадзора"    , Объект.ор_КодРосздравнадзора);
	СписокСвойств.Добавить("ор_МНН"                   , Объект.ор_МНН);
	СписокСвойств.Добавить("ор_ФТГ"                   , Объект.ор_ФТГ);
	
	Если НЕ Форма.Свойства_ИспользоватьСвойства
		ИЛИ НЕ Форма.Свойства_ИспользоватьДопРеквизиты Тогда
		
		Возврат;
	КонецЕсли;
	
	Для каждого Свойство Из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
		
		НаименованиеСвойства = Строка(Свойство.Свойство);
		ЗначениеСвойства     = "";
		
		Если ЗначениеЗаполнено(Свойство.ИмяРеквизитаЗначение) Тогда
			ЗначениеСвойства = Форма[Свойство.ИмяРеквизитаЗначение];
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеСвойства) = Тип("Булево") Тогда
			ЗначениеСвойства = ?(ЗначениеСвойства = Истина, Свойство.Наименование, "");
		ИначеЕсли НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЗначениеСвойства = "";
		КонецЕсли;
		
		СписокСвойств.Добавить(НаименованиеСвойства, ЗначениеСвойства);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСписокСвойствОбъектаДоговор(Форма, СписокСвойств, ПриСозданииНаСервере)
	
	Объект = Форма.Объект;
	
	Если ПриСозданииНаСервере И Форма.Параметры.Свойство("ТекстЗаполнения") Тогда
		СписокСвойств.Добавить("Наименование", Форма.Параметры.ТекстЗаполнения);
		ПолучитьСписокСвойствДоговора(Объект, СписокСвойств, Ложь);
	Иначе
		ПолучитьСписокСвойствДоговора(Объект, СписокСвойств);
	КонецЕсли;
	
	Если НЕ Форма.Свойства_ИспользоватьСвойства
		ИЛИ НЕ Форма.Свойства_ИспользоватьДопРеквизиты Тогда
		
		Возврат;
	КонецЕсли;
	
	Для каждого Свойство Из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
		
		НаименованиеСвойства = Строка(Свойство.Свойство);
		ЗначениеСвойства     = "";
		
		Если ЗначениеЗаполнено(Свойство.ИмяРеквизитаЗначение) Тогда
			ЗначениеСвойства = Форма[Свойство.ИмяРеквизитаЗначение];
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеСвойства) = Тип("Булево") Тогда
			ЗначениеСвойства = ?(ЗначениеСвойства = Истина, Свойство.Наименование, "");
		ИначеЕсли НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЗначениеСвойства = "";
		КонецЕсли;
		
		СписокСвойств.Добавить(НаименованиеСвойства, ЗначениеСвойства);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСписокСвойствОбъектаХарактеристика(Форма, СписокСвойств)
	
	СписокСвойств.Добавить("Наименование", Форма.Объект.Наименование);
	СписокСвойств.Добавить("Артикул", Форма.Объект.Артикул);
	
	СписокСвойств.Добавить("ор_НаименованиеПоставщика", Форма.Объект.ор_НаименованиеПоставщика);
	СписокСвойств.Добавить("ор_СерияПроизводителя"    , Форма.Объект.ор_СерияПроизводителя);
	СписокСвойств.Добавить("ор_ДатаИзготовления"      , Формат(Форма.Объект.ор_ДатаИзготовления, "ДФ=dd.MM.yyyy"));
	СписокСвойств.Добавить("ор_СрокГодности"          , Формат(Форма.Объект.ор_СрокГодности, "ДФ=dd.MM.yyyy"));
	СписокСвойств.Добавить("ор_Производитель"         , Форма.Объект.ор_Производитель);
	СписокСвойств.Добавить("ор_СтранаПроисхождения"   , Форма.Объект.ор_СтранаПроисхождения);
	
	Для каждого Свойство Из Форма.Свойства_ТаблицаСвойстваИЗначения Цикл
		
		НаименованиеСвойства = Строка(Свойство.Свойство);
		ЗначениеСвойства     = Свойство.Значение;
		
		Если ТипЗнч(ЗначениеСвойства) = Тип("Булево") Тогда
			ЗначениеСвойства = ?(ЗначениеСвойства = Истина, Свойство.Наименование, "");
		КонецЕсли;
		
		СписокСвойств.Добавить(НаименованиеСвойства, ЗначениеСвойства);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИнформациюОШаблонеВНастройкиФормы(Форма, Шаблон, ВидНаименования)
	
	НоваяСтрока = Форма.ШаблоныНаименованийКэш.Добавить();
	НоваяСтрока.ШаблонСсылка          = Шаблон;
	НоваяСтрока.ШаблонДляФормирования = Шаблон.ШаблонДляФормирования;
	НоваяСтрока.ВидНаименования       = ВидНаименования;
	
КонецПроцедуры

Процедура СФормироватьШаблон(ШаблонОбъект, НаборСвойств)
	
	ВидНаименования = ШаблонОбъект.ВидНаименования;
	
	ШаблонОбъект.ШаблонДляПредставления = "";
	ШаблонОбъект.ШаблонДляФормирования = "";
	
	Для каждого Эл Из НаборСвойств.ДополнительныеРеквизиты Цикл
		
		Если Эл.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидНаименования = Перечисления.ВидыНаименованийОбъектов.НоменклатураРабочее
			ИЛИ ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее Тогда
			
			Заголовок = "";
		Иначе
			
			ЭтоБулевскийРеквизит = ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(Эл.Свойство.ТипЗначения, Тип("Булево"));
			
			Если ЭтоБулевскийРеквизит Тогда
				Заголовок = "";
			Иначе
				Заголовок = Эл.Свойство.Заголовок + " ";
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШаблонОбъект.ШаблонДляПредставления) Тогда
			Разделитель = ", ";
		Иначе
			Разделитель = "";
		КонецЕсли;
		
		ПараметрПредставление = "[" + Эл.Свойство.Заголовок + "]";
		ПараметрФормирование  = "[" + Строка(Эл.Свойство) + "]";
		
		НовыйБлок = "{%1%2%3}";
		НовыйБлокПредставление = СтрШаблон(НовыйБлок, Разделитель, Заголовок, ПараметрПредставление);
		НовыйБлокФормирование  = СтрШаблон(НовыйБлок, Разделитель, Заголовок, ПараметрФормирование);
		
		ШаблонОбъект.ШаблонДляПредставления = ШаблонОбъект.ШаблонДляПредставления + НовыйБлокПредставление;
		ШаблонОбъект.ШаблонДляФормирования  = ШаблонОбъект.ШаблонДляФормирования + НовыйБлокФормирование;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыбратьШаблонНаименования(Шаблоны, КатегорияНоменклатуры, ВидНаименования)
	
	Шаблон = ШаблоныНаименованийПовтИсп.ПолучитьШаблонДляВидаНаименования(КатегорияНоменклатуры, ВидНаименования);
	
	Если ЗначениеЗаполнено(Шаблон) Тогда
		Возврат Шаблон;
	КонецЕсли;
	
	ИскомаяСтрока = Шаблоны.Найти(ВидНаименования, "ВидНаименования");
	Если ИскомаяСтрока <> Неопределено Тогда
		Шаблон = ИскомаяСтрока.Ссылка;
		Возврат Шаблон;
	КонецЕсли;
	
	Если Шаблоны.Количество() <> 0 Тогда
		Шаблон = Шаблоны[0].Ссылка;
		Возврат Шаблон;
	КонецЕсли;
	
КонецФункции

Функция УжеЕстьТакоеНаименование(СписокНаименований, НовоеНаименование)
	
	Для каждого Эл Из СписокНаименований Цикл
		
		Если Эл.Представление = НовоеНаименование Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПолучитьСписокСвойствДоговора(Объект, СписокСвойств, ДобавлятьНаименование = Истина)
	
	Если ДобавлятьНаименование Тогда
		СписокСвойств.Добавить("Наименование", Объект.Наименование);
	КонецЕсли;
	
	СписокСвойств.Добавить("Код", Объект.Код);
	СписокСвойств.Добавить("НомерДоговора", Объект.НомерДоговора);
	
	СписокСвойств.Добавить("ДатаНачала", Формат(Объект.ДатаДоговора,"ДФ=dd.MM.yyyy"));
	СписокСвойств.Добавить("ДатаОкончания", Формат(Объект.СрокДействия,"ДФ=dd.MM.yyyy"));
	СписокСвойств.Добавить("ДатаНачалаСокр", Формат(Объект.ДатаДоговора,"ДФ=dd.MM.yy"));
	СписокСвойств.Добавить("ДатаОкончанияСокр", Формат(Объект.СрокДействия,"ДФ=dd.MM.yy"));
	СписокСвойств.Добавить("Организация", Объект.Организация);
	СписокСвойств.Добавить("Валюта", Объект.ВалютаРасчетов);
	СписокСвойств.Добавить("ВидДоговора", НРег(Объект.ВидДоговора));
	
КонецПроцедуры

Функция ШаблонНаименованияДоговораПоУмолчанию()
	УстановитьПривилегированныйРежим(Истина);
	ШаблонПоУмолчанию = Константы.ШаблонНаименованияДоговоров.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	Если Не ЗначениеЗаполнено(ШаблонПоУмолчанию) Тогда
		Возврат НСтр("ru='Основной договор'");
	Иначе
		Возврат ШаблонПоУмолчанию.ШаблонДляФормирования;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьШаблонПолногоНаименования(Форма, СписокСвойств, Шаблон, СформированныеНаименования)

	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		
		КопияСписка = СписокСвойств.Скопировать();
		ДобавлятьШаблон = Ложь;	
		
		Для каждого Свойство Из Форма.Свойства_ТаблицаСвойстваИЗначения Цикл
			НаименованиеСвойства = Строка(Свойство.Свойство);
			ЗначениеСвойства     = Свойство.Значение;
			ЗначениеСписка = КопияСписка.НайтиПоЗначению(НаименованиеСвойства);
			Если ЗначениеСписка <> Неопределено 
				И ТипЗнч(ЗначениеСвойства) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
				ПолноеНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеСвойства, "ПолноеНаименование"); 
				Если НЕ ПустаяСтрока(ПолноеНаименование) Тогда
					ЗначениеСписка.Представление = ПолноеНаименование; 
					ДобавлятьШаблон = Истина;
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
		
		Если ДобавлятьШаблон Тогда
			СФормированноеНаименование = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(КопияСписка,
				Шаблон.ШаблонДляФормирования);
			Если ЗначениеЗаполнено(СФормированноеНаименование) 
				И НЕ УжеЕстьТакоеНаименование(СформированныеНаименования, СФормированноеНаименование) Тогда
				СформированныеНаименования.Добавить(Шаблон.Ссылка, СФормированноеНаименование);
			КонецЕсли;				
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#Область ОтраслевыеПроцедурыИФункции

// Структура - содержит описание подменямых реквизитов при рисовки реквизитов и элементов формы
// Описание состоит из двух соответсвий: РеквизитыКПодмене и ЗамененныеРеквизиты
//	РеквизитыКПодмене - Соответсвие - ИмяРеквизита и СтруктруПодмены
//		СтруктураПодмены - Структура - Описание подменяемого реквизита структуру из ОписаниеЭлемента.
//										в описании элемента хранится структура из двух соответствий:
//										ОписаниеСвойств и ОписаниеСобытий.
//					подробно см. функции ПустаяСтруктураПодменногоРевквизита() и ПустаяСтруктураОписанияЭлемента().
//	ЗамененныеРеквизиты - Соотвествие - ИмяЗамененое и ИмяЗаменяемогоРеквизита,
//											служит для облегчения поиска уже добавленых реквизитов
Функция ОписаниеРеквизитовПодмены()
	
	РеквизитыКПодмене   = Новый Соответствие;
	ЗамененныеРеквизиты = Новый Соответствие;
	
	СтурктураПодмены = ПустаяСтруктураПодменногоРевквизита();
	
	Возврат Новый Структура("РеквизитыКПодмене,ЗамененныеРеквизиты",РеквизитыКПодмене,ЗамененныеРеквизиты);
	
КонецФункции

Функция ПустаяСтруктураОписанияЭлемента()
	
	ОписаниеСвойств = Новый Соответствие();
	
	ОписаниеСвойств.Вставить("КнопкаВыбора", Ложь);
	ОписаниеСвойств.Вставить("КнопкаОчистки",Ложь);
	ОписаниеСвойств.Вставить("ОтображениеКнопкиВыбора", ОтображениеКнопкиВыбора.ОтображатьВПолеВвода);
	ОписаниеСвойств.Вставить("РедактированиеТекста",Ложь);
	
	ОписаниеСобытий = Новый Соответствие();
	
	ОписаниеСобытий.Вставить("Создание"     ,"Подключаемый_Создание");
	ОписаниеСобытий.Вставить("ПриИзменении" ,"Подключаемый_ПриИзменении");
	ОписаниеСобытий.Вставить("НачалоВыбора" ,"Подключаемый_НачалоВыбора");
	ОписаниеСобытий.Вставить("Очистка"      ,"Подключаемый_Очистка");
	
	Возврат Новый Структура("Свойства,События",ОписаниеСвойств,ОписаниеСобытий);
	
КонецФункции

Функция ПустаяСтруктураПодменногоРевквизита()
	
	Структура = Новый Структура;
	
	Структура.Вставить("ПутьЗамены",""); // Обязательно к заполнению.
	Структура.Вставить("ТипРеквизита", Новый ОписаниеТипов("Строка"));
	Структура.Вставить("ТребуетсяДополнительныйРеквизит",Ложь);
	Структура.Вставить("ДополнительныйРеквизит", Неопределено); // Место для размещения реквизита формы: Новый РеквизитФормы();.
	Структура.Вставить("ОписаниеЭлемента", ПустаяСтруктураОписанияЭлемента());
	
	Возврат Структура;
	
КонецФункции

Функция ПолучитьСтруктуруПараметровШаблонаНаименования(КатегорияНоменклатуры, Шаблон, ОписаниеДополнительныхРеквизитов = Неопределено)
	
	ВидНаименования   = Шаблон.ВидНаименования;
	ДляХарактеристики = ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее
		Или ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаДляПечати
		Или Шаблон.ДляХарактеристики;
	
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения");
	ДополнительныеРеквизиты = Неопределено;
	Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
		Если ДляХарактеристики Тогда
			ДополнительныеРеквизиты = Шаблон.Владелец.НаборСвойствХарактеристики.ДополнительныеРеквизиты.Выгрузить();
		Иначе
			ДополнительныеРеквизиты = Шаблон.Владелец.НаборСвойств.ДополнительныеРеквизиты.Выгрузить();
		КонецЕсли;
		ДополнительныеРеквизиты.Колонки.Добавить("ИмяСвойства", Новый ОписаниеТипов("Строка"));
		Для Каждого ТекущиеДанные Из ДополнительныеРеквизиты Цикл
			ТекущиеДанные.ИмяСвойства = Строка(ТекущиеДанные.Свойство);
		КонецЦикла;
	КонецЕсли;
	
	БлокиШаблона = ШаблоныНаименованийКлиентСервер.РазделитьШаблонНаБлоки(Шаблон.ШаблонДляФормирования);
	Если ДляХарактеристики Тогда
		МетаданныеОбъекта = Метаданные.Справочники.ХарактеристикиНоменклатуры;
	Иначе
		МетаданныеОбъекта = Метаданные.Справочники.Номенклатура;
	КонецЕсли;
	
	ИмяЭлементаНачало = "ПараметрИменования_"  + СтрЗаменить(ВРег(КатегорияНоменклатуры.УникальныйИдентификатор()), "-", "x") + "_";
	
	ПараметрыШаблона = Новый Массив;
	
	Для Каждого Блок Из БлокиШаблона Цикл
		
		Если НЕ Блок.ЭтоПараметр Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметра = Новый Структура;
		
		ИмяПараметра = Блок.Параметр;
		ИмяЭлемента  = ИмяЭлементаНачало;
		
		ДанныеРеквизита = МетаданныеОбъекта.Реквизиты.Найти(ИмяПараметра);
		Если ДанныеРеквизита = Неопределено
			И СтрНайти("код,наименование,родитель,владелец", НРег(ИмяПараметра)) > 0 Тогда
			ДанныеРеквизита = МетаданныеОбъекта.СтандартныеРеквизиты[ИмяПараметра];
		КонецЕсли;
		Если Не ДанныеРеквизита = Неопределено Тогда
			
			ИмяЭлемента = ИмяЭлемента + СтрЗаменить(ВРег(Новый УникальныйИдентификатор), "-", "x");
			
			Если ДляХарактеристики Тогда
				ПриставкаКПути = "Характеристика_";
			Иначе
				ПриставкаКПути = "Номенклатура_";
			КонецЕсли;
			ПутьКДанным = ПриставкаКПути + ИмяПараметра;
			
			СтруктураПараметра.Вставить("ТипРеквизита", ДанныеРеквизита.Тип);
			СтруктураПараметра.Вставить("Заголовок"   , ДанныеРеквизита.Синоним);
			СтруктураПараметра.Вставить("ДополнительныеЗначенияИспользуются",Ложь);
			СтруктураПараметра.Вставить("ЭтоДопРеквизит", Ложь);
			СтруктураПараметра.Вставить("ЭтоДопСведение", Ложь);
			
		ИначеЕсли ИспользоватьДополнительныеРеквизитыИСведения Тогда
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ИмяСвойства", ИмяПараметра);
			ПараметрыОтбора.Вставить("ПометкаУдаления", Ложь);
			НайденныеСтроки = ДополнительныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			ТекущееСвойство = НайденныеСтроки[0].Свойство;
			
			ИмяЭлемента = ИмяЭлемента + СтрЗаменить(ВРег(ТекущееСвойство.УникальныйИдентификатор()), "-", "x");
			ПутьКДанным = ИмяЭлемента;
			
			Если ОписаниеДополнительныхРеквизитов <> Неопределено Тогда
				ПараметрыОтбора = Новый Структура("Свойство", ТекущееСвойство);
				НайденныеСтроки = ОписаниеДополнительныхРеквизитов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ПутьКДанным = НайденныеСтроки[0].ИмяРеквизитаЗначение;
				КонецЕсли;
			КонецЕсли;
			
			СтруктураПараметра.Вставить("ТипРеквизита", ТекущееСвойство.ТипЗначения);
			СтруктураПараметра.Вставить("Заголовок"   , ТекущееСвойство.Заголовок);
			
			СтруктураПараметра.Вставить("ДополнительныеЗначенияИспользуются", ТекущееСвойство.ДополнительныеЗначенияИспользуются);
			Если ЗначениеЗаполнено(ТекущееСвойство.ВладелецДополнительныхЗначений) Тогда
				СтруктураПараметра.Вставить("ВладелецДопЗначений", ТекущееСвойство.ВладелецДополнительныхЗначений);
			Иначе
				СтруктураПараметра.Вставить("ВладелецДопЗначений", ТекущееСвойство);
			КонецЕсли;
			СтруктураПараметра.Вставить("ЭтоДопРеквизит", Не ТекущееСвойство.ЭтоДополнительноеСведение);
			СтруктураПараметра.Вставить("ЭтоДопСведение", ТекущееСвойство.ЭтоДополнительноеСведение);
			СтруктураПараметра.Вставить("Свойство", ТекущееСвойство);
			
		Иначе
			// Не нашли параметр в справочникие и его доп. реквизитах.
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметра.Вставить("ИмяПараметра"          , ИмяПараметра);
		СтруктураПараметра.Вставить("ИмяЭлемента"           , ИмяЭлемента);
		СтруктураПараметра.Вставить("ПутьКДанным"           , ПутьКДанным);
		СтруктураПараметра.Вставить("ДанныеПараметраСтрокой", "");
		СтруктураПараметра.Вставить("ДляНоменклатуры"       , Не ДляХарактеристики);
		
		ПараметрыШаблона.Добавить(СтруктураПараметра);
		
	КонецЦикла;
	
	Возврат ПараметрыШаблона;
	
КонецФункции

Процедура ПодменитьНестандартныеРеквизиты(МассивПараметровПравила)
	
	СтруктураПодмененынх = ОписаниеРеквизитовПодмены();
	
	Если НЕ СтруктураПодмененынх.Свойство("РеквизитыКПодмене") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из МассивПараметровПравила Цикл
		СтруктураПодмены = СтруктураПодмененынх.РеквизитыКПодмене.Получить(Строка.ПутьКДанным);
		Если ЗначениеЗаполнено(СтруктураПодмены) Тогда
			Строка.ПутьКДанным  = СтруктураПодмены.ПутьЗамены;
			Строка.ТипРеквизита = СтруктураПодмены.ТипРеквизита;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекущиеРеквизитыФормы(Форма)
	
	МассивРеквизитов = Новый Массив();
	Для Каждого Реквизит Из Форма.ПолучитьРеквизиты() Цикл
		МассивРеквизитов.Добавить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат МассивРеквизитов;
	
КонецФункции

// Возвращает имя реквизита на форме по соответсвию, если реквизит не найден возвращается Неопределено.
//
функция ПолучитьИмяНаФормеСозданияНоменклатуры(ИмяРеквизита, РеквизитыФормы)
	
	// Список отраслевых реквизитов добавленые на форму ор_СозданияНоменклатуры
	// список реквизитов можно найти в Обработкае ор_СозданиеНоменклатуры.ФормаПомошник - процедура СформироватьПараметрыИСоздатьРеквизиты
	// формируем список вручную, потому что имена не совпадают с именами реквизитов номенклатуры или характеристики.
	// Пример, для номенклатуры:
	// 			ОтраслевыеРеквизитыФормы.Вставить([Номенклатура_[ИмяОтраслевгоРеквизитаНоменклатуры]],[ИмяРеквизитаНаФормеПомошника]);
	// 				ОтраслевыеРеквизитыФормы.Вставить("Номенклатура_ор_ПробаМеталла","Проба");
	// 			для характеристики: 
	// 			ОтраслевыеРеквизитыФормы.Вставить([Характеристика_[ИмяОтраслевгоРеквизитаНоменклатуры]],[ИмяРеквизитаНаФормеПомошника]);
	// 				ОтраслевыеРеквизитыФормы.Вставить("Характеристика_ор_ПробаМеталла","Проба");
	
	ОтраслевыеРеквизитыФормы = Новый Соответствие();
	
	ОтраслевыеРеквизитыФормы.Вставить("Номенклатура_Артикул"         , "Артикул");
	ОтраслевыеРеквизитыФормы.Вставить("Номенклатура_ЦеноваяГруппа"   , "ЦеноваяГруппа");
	ОтраслевыеРеквизитыФормы.Вставить("Номенклатура_ЕдиницаИзмерения", "ЕдиницаИзмерения");
	
	ИмяНаФорме = ОтраслевыеРеквизитыФормы.Получить(ИмяРеквизита);
	
	Если ЗначениеЗаполнено(ИмяНаФорме) Тогда
		Индекс = РеквизитыФормы.Найти(ИмяНаФорме);
		Если Индекс <> Неопределено Тогда
			Возврат РеквизитыФормы[Индекс];
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Провереяет массивСоздаваемых реквизитов на наличие подмененых
// Если находится подмененый реквизит, проверяется существует ли для него дополнительный реквизит на форме
// если дополнительный реквизит требуется, и не существует, в МассивРеквизитов добавляется реквизит 
//	указаный в ОписанииРеквизитовПодмены().
Процедура ОбработатьПодмененыеРеквизиты(МассивРеквизитов)
	
	СтруктураПодмененных = ОписаниеРеквизитовПодмены();
	
	Если НЕ СтруктураПодмененных.Свойство("РеквизитыКПодмене") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработка Добавляемых реквизитов
	Для Каждого ТекРеквизит Из МассивРеквизитов Цикл
		ИзмененыйРеквизит = СтруктураПодмененных.ЗамененныеРеквизиты.Получить(ТекРеквизит.Имя);
		Если ЗначениеЗаполнено(ИзмененыйРеквизит) Тогда
			СтруктураДобавляемого = СтруктураПодмененных.РеквизитыКПодмене.Получить(ИзмененыйРеквизит);
			Если СтруктураДобавляемого.ТребуетсяДополнительныйРеквизит 
				 И СтруктураДобавляемого.ДополнительныйРеквизит <> Неопределено Тогда
					МассивРеквизитов.Добавить(СтруктураДобавляемого.ДополнительныйРеквизит);
			КонецЕсли;
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьПодмененыеЭлементы(Форма, МассивПараметров)
	
	СтруктураПодмененных = ОписаниеРеквизитовПодмены();
	
	Если НЕ СтруктураПодмененных.Свойство("РеквизитыКПодмене") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из МассивПараметров Цикл
		ИмяРеквизита = СтруктураПодмененных.ЗамененныеРеквизиты.Получить(ТекЭлемент.ПутьКДанным);
		Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
			СтруктураЭлемента = СтруктураПодмененных.РеквизитыКПодмене.Получить(ИмяРеквизита);
			ЭлементФормы = Форма.Элементы.Найти(ТекЭлемент.ИмяЭлемента);
			Если ЭлементФормы = Неопределено Тогда
				// Продолжаем если элемент не найден
				Продолжить;
			КонецЕсли;
			
			Для каждого Свойство Из СтруктураЭлемента.ОписаниеЭлемента.Свойства Цикл
				ЭлементФормы[Свойство.Ключ] = Свойство.Значение;
			КонецЦикла;
			
			Для каждого Событие Из СтруктураЭлемента.ОписаниеЭлемента.События Цикл
				ЭлементФормы.УстановитьДействие(Событие.Ключ,Событие.Значение);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет на форму элементы правила именования.
// 
// Параметры:
//	Форма - УправляемаяФорма - форма, которую необходимо обработать.
//	ГруппаПараметровИменования - ГруппаФормы - группа, в которой будут располагаться новые элементы.
//	ГруппаДекорацийПараметровИменования - ГруппаФормы - группа, в которой будут располагаться декорации для новых элементов.
//
Процедура ДобавитьЭлементыПравилаИменования(Форма, ГруппаПараметровИменования)
	
	Для Каждого Строка Из Форма.ПараметрыПравилаИменования Цикл
		
		НовыйЭлемент = Форма.Элементы.Добавить(Строка.ИмяЭлемента,Тип("ПолеФормы"), ГруппаПараметровИменования);
		НовыйЭлемент.ПутьКДанным = Строка.ПутьКДанным;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Заголовок = Строка.Заголовок;
		НовыйЭлемент.МаксимальнаяШирина = 40;
		НовыйЭлемент.Формат = Формат("ДФ=dd.MM.yyyy; БЛ=Нет; БИ=Да");
		НовыйЭлемент.ФорматРедактирования = Формат("ДФ=dd.MM.yyyy; БЛ=Нет; БИ=Да");
		
		Если Строка.ИмяПараметра = "ор_НаименованиеПоставщика" Тогда
			НовыйЭлемент.ПропускатьПриВводе = Истина;
			НовыйЭлемент.Видимость = Ложь;
			НовыйЭлемент.Доступность = Ложь;
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.АвтоОтметкаНезаполненного = Ложь;
		КонецЕсли;
		
		Если Строка.ДополнительныеЗначенияИспользуются Тогда
			МассивПараметровВыбора = Новый Массив;
			МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Строка.ВладелецДопЗначений));
			НовыйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		КонецЕсли;
		
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПараметрИменованияПриИзменении");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
